In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series(range(100,110),dtype=float)

In [3]:
s

0    100.0
1    101.0
2    102.0
3    103.0
4    104.0
5    105.0
6    106.0
7    107.0
8    108.0
9    109.0
dtype: float64

In [4]:
pd.Series({"apple":"A sweet red","mango":"A king of fruit"})

apple        A sweet red
mango    A king of fruit
dtype: object

In [5]:
pd.Series(["king of fruit","A sweet fruit"],index=["mango","apple"])

mango    king of fruit
apple    A sweet fruit
dtype: object

In [6]:
n=np.random.randint(10,20,(5,5))

In [7]:
pd.DataFrame(n)

    0   1   2   3   4
0  15  17  18  12  19
1  10  14  13  12  18
2  12  16  18  15  17
3  11  18  16  16  13
4  15  11  16  17  11

In [8]:
ind=np.random.randint(50,100,(5,))

In [9]:
cols=np.random.randint(50,100,(5,))

In [10]:
cols1=["A","B","C","D","E"]

In [11]:
ind,cols

(array([72, 73, 70, 71, 80]), array([51, 66, 93, 94, 73]))

In [12]:
pd.DataFrame(n ,index=ind,columns=cols1)

     A   B   C   D   E
72  15  17  18  12  19
73  10  14  13  12  18
70  12  16  18  15  17
71  11  18  16  16  13
80  15  11  16  17  11

In [13]:
names=["Anuj" ,"Naman","mohit"]
age=[26,21,28]

In [14]:
d={"names":names,"age":age}

In [15]:
d

{'names': ['Anuj', 'Naman', 'mohit'], 'age': [26, 21, 28]}

In [16]:
pd.DataFrame(d)

   names  age
0   Anuj   26
1  Naman   21
2  mohit   28

In [17]:
li=[{"name":"naman","age":21},{"name":"anuj","age":28}]

In [47]:
a=pd.DataFrame(li)

In [64]:
#a.to_csv("hello.csv",index=False , sep=";",line_terminator="-")     ###  Comma seprated value(csv)
a.to_csv("hello.csv")

In [65]:
##pd.read_csv("hello.csv" , sep=";" , lineterminator="-")
a=pd.read_csv("hello.csv")

In [66]:
a

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
0           0             0               0  naman   21  delhi
1           1             1               1   anuj   28  delhi
2           2             2               2   aman   19  delhi

In [67]:
a.to_excel("hello.xls")

In [68]:
a.to_html("httml.html")

In [69]:
a.name

0    naman
1     anuj
2     aman
Name: name, dtype: object

In [70]:
a["name"]

0    naman
1     anuj
2     aman
Name: name, dtype: object

In [72]:
a["place"]=["delhi"]*3

In [73]:
a

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
0           0             0               0  naman   21  delhi
1           1             1               1   anuj   28  delhi
2           2             2               2   aman   19  delhi

In [74]:
a[["name","age"]]

    name  age
0  naman   21
1   anuj   28
2   aman   19

In [75]:
a

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
0           0             0               0  naman   21  delhi
1           1             1               1   anuj   28  delhi
2           2             2               2   aman   19  delhi

In [79]:
a.loc[a.age>20]
## a[a.age>20]   #### same as above

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
0           0             0               0  naman   21  delhi
1           1             1               1   anuj   28  delhi

In [80]:
a.age>20

0     True
1     True
2    False
Name: age, dtype: bool

In [85]:
a.iloc[1:,3:]   ### one is for row and second is for columb #### and iloc is for index only

   name  age  place
1  anuj   28  delhi
2  aman   19  delhi

In [88]:
a.iloc[::-1,3:]    ###first part is used to reverse

    name  age  place
2   aman   19  delhi
1   anuj   28  delhi
0  naman   21  delhi

In [89]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
Unnamed: 0        3 non-null int64
Unnamed: 0.1      3 non-null int64
Unnamed: 0.1.1    3 non-null int64
name              3 non-null object
age               3 non-null int64
place             3 non-null object
dtypes: int64(4), object(2)
memory usage: 272.0+ bytes

In [94]:
another=a.describe()

In [95]:
type(another)

pandas.core.frame.DataFrame

In [96]:
a.sort_index(ascending=False)

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
2           2             2               2   aman   19  delhi
1           1             1               1   anuj   28  delhi
0           0             0               0  naman   21  delhi

In [100]:
a.sort_index(axis=1,ascending=False)  ## for axis 0 it will sort according to row and for axis 1 it wills sort for col

   place   name  age  Unnamed: 0.1.1  Unnamed: 0.1  Unnamed: 0
0  delhi  naman   21               0             0           0
1  delhi   anuj   28               1             1           1
2  delhi   aman   19               2             2           2

In [102]:
a.sort_values("age",ascending=False)

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
1           1             1               1   anuj   28  delhi
0           0             0               0  naman   21  delhi
2           2             2               2   aman   19  delhi

In [106]:
a.sort_values("name",axis=0)

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
2           2             2               2   aman   19  delhi
1           1             1               1   anuj   28  delhi
0           0             0               0  naman   21  delhi

In [140]:
data=pd.DataFrame(np.random.randint(10,20,(5,5)))

In [141]:
data

    0   1   2   3   4
0  19  16  19  14  14
1  19  11  18  13  13
2  19  13  15  10  12
3  15  16  16  13  19
4  13  16  12  17  17

In [142]:
data.sort_values(2,axis=1)

    3   4   1   2   0
0  14  14  16  19  19
1  13  13  11  18  19
2  10  12  13  15  19
3  13  19  16  16  15
4  17  17  16  12  13

In [111]:
a.index    ##it will give row index

RangeIndex(start=0, stop=3, step=1)

In [112]:
a.columns

Index(['Unnamed: 0', 'Unnamed: 0.1', 'Unnamed: 0.1.1', 'name', 'age', 'place'], dtype='object')

In [113]:
## col

In [124]:
b=a.to_numpy 
#### by using to we can convert into many forms

In [125]:
a.values

array([[0, 0, 0, 'naman', 21, 'delhi'],
       [1, 1, 1, 'anuj', 28, 'delhi'],
       [2, 2, 2, 'aman', 19, 'delhi']], dtype=object)

In [127]:
data.loc[0,0]

15

In [128]:
a.at[0,"age"]

21

In [129]:
a

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
0           0             0               0  naman   21  delhi
1           1             1               1   anuj   28  delhi
2           2             2               2   aman   19  delhi

In [134]:
a.at[0,"age"]="90"

In [135]:
a

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place
0           0             0               0  naman   90  delhi
1           1             1               1   anuj   28  delhi
2           2             2               2   aman   19  delhi

In [136]:
a.loc[:3,-1]="noida"

In [137]:
a

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place     -1
0           0             0               0  naman   90  delhi  noida
1           1             1               1   anuj   28  delhi  noida
2           2             2               2   aman   19  delhi  noida

In [143]:
data.apply(lambda item:item+4)

    0   1   2   3   4
0  23  20  23  18  18
1  23  15  22  17  17
2  23  17  19  14  16
3  19  20  20  17  23
4  17  20  16  21  21

In [146]:
data.apply(lambda item :print(item))

0    19
1    19
2    19
3    15
4    13
Name: 0, dtype: int32
0    16
1    11
2    13
3    16
4    16
Name: 1, dtype: int32
0    19
1    18
2    15
3    16
4    12
Name: 2, dtype: int32
0    14
1    13
2    10
3    13
4    17
Name: 3, dtype: int32
0    14
1    13
2    12
3    19
4    17
Name: 4, dtype: int32

0    None
1    None
2    None
3    None
4    None
dtype: object

In [148]:
a["age"]=a["age"]+1

In [149]:
a

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place     -1
0           0             0               0  naman   91  delhi  noida
1           1             1               1   anuj   29  delhi  noida
2           2             2               2   aman   20  delhi  noida

In [151]:
## by function
def inc(a):
    a["age"]=a[age] +1
    return a

In [152]:
a

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place     -1
0           0             0               0  naman   91  delhi  noida
1           1             1               1   anuj   29  delhi  noida
2           2             2               2   aman   20  delhi  noida

In [158]:
def inc(item):
    item['age']=item["age"]+1
    return item

In [159]:
a.apply(inc,axis=1)

   Unnamed: 0  Unnamed: 0.1  Unnamed: 0.1.1   name  age  place     -1
0           0             0               0  naman   92  delhi  noida
1           1             1               1   anuj   30  delhi  noida
2           2             2               2   aman   21  delhi  noida